app/controllers/students_controller.rb

  def create
    @student= Student.create(student_params(:title, :room_number))
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-09-20 16:45:42.797333"], ["updated_at", "2018-09-20 16:45:42.797333"]]